// ========================================================================================
// Компонент превью объявления, группа из которых формирует список объявлений на главной
// Полностью кликабельный, состоит из изображения и краткого описания товара
// ========================================================================================

import catImage from '../assets/cat.jpg';
import { Link } from 'react-router-dom';
import './AdPreview.css'


export default function AdPreview({ ad }) {
  return (
    <Link to={`/item/${ad.id}`} style={{ textDecoration: 'none', color: 'inherit' }}>

      <div className="ad-preview">
        <img src={ad.images[0] || catImage} alt="Товар" />
        <div className='description-container'>
          <h3>{ad.title}</h3>
          <p>{ad.price} ₽</p>
          <p>Категория: {ad.category}</p>
          <p>Дата: {ad.createdAt.slice(0, 10)}</p>
          <p>Статус: {ad.status === "rejected" ? "Отклонено ❌" : ad.status === "approved" ? "Одобрено ✅" : "На доработку🟡"}</p>
          <p>Приоритет: {ad.priority === "urgent" ? "Срочный ❗️" : "Нормальный"}</p>
        </div>
      </div>
    </Link>
  );
}
